package com.example.explorebd;


import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.DividerItemDecoration;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.view.MenuItem;

import com.blogspot.atifsoftwares.animatoolib.Animatoo;

import java.util.ArrayList;
import java.util.List;

public class NationalActivity extends AppCompatActivity {

    RecyclerView recyclerView;

    List<Movie> movieList;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_national);

        //add back button in the toolbar
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        getSupportActionBar().setDisplayShowHomeEnabled(true);


        recyclerView = findViewById(R.id.recyclerView);

        initData();
        initRecyclerView();
    }

    //animation
    @Override
    public void onBackPressed() {
        super.onBackPressed();
        Animatoo.animateSlideRight(this);
    }


    //add back button to the toolbar

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        {
            if(item.getItemId()==android.R.id.home)
            {
                this.finish();
            }
        }
        return super.onOptionsItemSelected(item);
    }

    private void initRecyclerView() {
        MovieAdapter movieAdapter = new MovieAdapter(movieList);
        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        recyclerView.setAdapter(movieAdapter);
    }

    private void initData() {
        movieList = new ArrayList<>();
        movieList.add(new Movie("জাতীয় জরুরি সেবা, ৯৯৯", "২৪ ঘণ্টা", "৯৯৯", "যেকোনো পরিস্থিতিতে এখন দেশের জাতীয় জরুরি সেবা নম্বর হলো ৯৯৯। এই নম্বরে কল করে বাংলাদেশের সকল প্রান্ত থেকে জরুরি মূহুর্তে ফায়ার সার্ভিস, পুলিশ বা অ্যাম্বুলেন্স সেবা পাওয়া যাবে। পুলিশের অধীনে এই কল সেন্টার পরিচালিত হচ্ছে। দিনরাত ২৪ ঘণ্টা যেকোনো ফোন থেকে বিনা মূল্যে ৯৯৯ নম্বরে ফোন করা যায়।"));
        movieList.add(new Movie("বাংলাদেশ ট্যুরিস্ট পুলিশ","","+৮৮-০২৮৩৯৯২৩০","দেশের বিভিন্ন পর্যটন স্থানে ভ্রমণকারীদের যেকোনো ধরনের সহযোগিতা ও সমস্যা সমাধানে ২০১৩ সালের ট্যুরিস্ট পুলিশ বাংলাদেশ গঠন করা হয়। বর্তমানে বাংলাদেশের ২৯ জেলার বিভিন্ন স্থানে ট্যুরিস্ট পুলিশের কার্যক্রম চালু রয়েছে।     \n\nহেডকোয়াটার -\n\nঠিকানা : বাড়ি #৩২, রোড #০১, ব্লক #এ বনশ্রী, রামপুরা, ঢাকা-১২১৯\nফোন : +৮৮-০২৮৩৯৯২৩০\nওয়েবসাইট : tourist.police.gov.bd\n\nঢাকা জোন -\n\nঠিকানা : তাহমিনা মঞ্জিল, হাউস #৯/৫, ব্লক #জে, বনশ্রী, রামপুরা, ঢাকা-১২১৯\nফোন : ০২-৭৮১১৯৯০\n\nচট্টগ্রাম জোন -\n\nঠিকানা : প্লট #ডি/১৩, কল্পলোক আবাসিক এলাকা, বাকলিয়া, চট্টগ্রাম\nমোবাইল : ০১৭৬৯-৬৯০৭৩০\n\nবান্দরবান জোন -\n\nঠিকানা : মেঘলা, জেলা পরিষদ বাংলো, বান্দরবান\nমোবাইল : ০১৭৬৯-৬৯৩০৩৭\n\nরাঙ্গামাটি জোন -\n\nঠিকানা : পুরাতন বাস স্ট্যান্ড, রাঙ্গামাটি\nমোবাইল : +৮৮-০১৭৬৯৬৯৩০৩৩\n\nকক্সবাজার জোন -\n\nঠিকানা : এ এইচ টাওয়ার , খুরুশকুল রোড , কক্সবাজার \nমোবাইল : ০১৭৬৯-৬৯০৭৩২\n\nসিলেট জোন -\n\nঠিকানা : ৩৬৮ , শেখঘাট , সিলেট \nমোবাইল : ০১৭৬৯-৬৯০৭১৮\n\nবগুড়া জোন\n\nঠিকানা : উপশহর , রোড ২৫ , হাউস ০৫ , বগুড়া সদর \nমোবাইল : ০১৭৬৯-৬৯৩০৫১\n\nকুয়াকাটা জোন -\n\nঠিকানা : আনন্দ বাড়ি , কলাপাড়া , পটুয়াখালী\nমোবাইল : ০১৭৬৯-৬৯০৭১৯\n\nসুন্দরবন জোন\n\nঠিকানা : মুজগুন্নি আবাসিক এলাকা , বয়রা , খুলনা \nমোবাইল : ০১৭৬৯-৬৯৩০১৩\n\n"));
        movieList.add(new Movie("নারী ও শিশু নির্যাতন প্রতিরোধ সেল", "২৪ ঘণ্টা", "১০৯২১", "নারী ও শিশু নির্যাতন প্রতিরোধে 'মহিলা ও শিশুবিষয়ক মন্ত্রণালয়ের' অধীনে নারী নির্যাতন প্রতিরোধকল্পে মাল্টিসেক্টরাল কর্মসূচির আওতায় এই হেল্পলাইন কর্মসূচি পরিচালিত হচ্ছে।  কোনো নারী নির্যাতন কিংবা অপমানিত হওয়ার আশঙ্কা করলে সঙ্গে সঙ্গে এই নম্বরে ফোন করে সাহায্য চাইতে পারেন। সপ্তাহের সাত দিন ২৪ ঘণ্টা  বিনামূল্যে এই নাম্বারে কল করা যাবে।"));
        movieList.add(new Movie("দুর্নীতি দমন কমিশন (দুদক)","","১০৬","দুর্নীতি ও অনিয়মের তথ্য জানাতে দুর্নীতি দমন কমিশন ১০৬ হেল্পলাইন চালু করে। যে কেউ বিনা মূল্যে সকাল নয়টা থেকে বিকেল পাঁচটা পর্যন্ত  এই নম্বরে কল করতে পারবে। এ ক্ষেত্রে অভিযোগকারীর নাম ও পরিচয় গোপন রাখা হয়।"));
        movieList.add(new Movie("দুর্যোগের আগাম বার্তা ","","২০১৬","দূর্যোগ ও ত্রাণ মন্ত্রণালয়ের উদ্যোগে যে কোন মোবাইল ফোন হতে ১০৯০ হেল্পলাইন নম্বরে ডায়াল করে ১ ডায়াল করলে সমূদ্রগামী জেলেদের জন্য আবহাওয়া বার্তা; ২ ডায়াল করলে নদী বন্দরসমূহের জন্য সতর্ক সংকেত; ৩ ডায়াল করলে দৈনন্দিন আবহাওয়া বার্তা; ৪ ডায়াল করলে ঘূর্ণিঝড়ের সতর্ক সংকেত; ৫ ডায়াল করলে দেশের বন্যা তথা বিভিন্ন নদ/নদীর পানি হ্রাসবৃদ্ধি অবস্থা সম্পর্কিত তথ্য অবহিত হওয়া যাবে।"));
        movieList.add(new Movie("স্বাস্থ্য বাতায়ন", "২৪ ঘণ্টা", "১৬২৬৩", "স্বাস্থ্য মন্ত্রণালয় পরিচালিত ১৬২৬৩ নম্বরে ফোন করে স্বাস্থ্যসংক্রান্ত যেকোনো বিষয়ে সরাসরি চিকিৎসকের সঙ্গে কথা বলে আপনি পরামর্শ পেতে পারেন। দিনরাত ২৪ ঘণ্টা খোলা থাকে এই নম্বর। এ ছাড়া স্বাস্থ্য বাতায়ন থেকে সরকারি হাসপাতাল, ডাক্তারের তথ্য কিংবা স্বাস্থ্যসেবা–বিষয়ক অন্যান্য যেকোনো তথ্য ও ফোন নম্বর পাওয়া যাবে। সরকারি, বেসরকারি স্বাস্থ্যসেবা অথবা হাসপাতাল–বিষয়ক যেকোনো অভিযোগ কিংবা পরামর্শও এই নম্বরে জানানো যাবে। এই নম্বরে ফোন করতে প্রতিমিনিট ২.৩৭ টাকা চার্জ (ভ্যাটসহ) প্রযোজ্য।"));
        movieList.add(new Movie("জাতীয় পরিচয়পত্র", "", "১০৫", "জাতীয় পরিচয়পত্র বিষয়ে যেকোনো তথ্যের জন্য  ২০১৫ সালে  নির্বাচন কমিশন এই হেল্পডেস্ক চালু করেছে। দেশের যেকোনো প্রান্ত থেকে যে কেউ এই হেল্পলাইনে ফোন করে জাতীয় পরিচয়পত্র–সংক্রান্ত প্রয়োজনীয় তথ্য জানতে পারবে।"));
        movieList.add(new Movie("সরকারি আইন সেবা", "", "১৬৪৩০", "বিনা মূল্যে আইনি পরামর্শ ও আইনগত সহায়তা দিতে ২০১৬ সাল থেকে আইন ও বিচার বিভাগের অধীনে জাতীয় আইনগত সহায়তা সংস্থা  ১৬৪৩০ নম্বরে আইনি সেবা দিয়ে আসছে।"));
        movieList.add(new Movie("কৃষি কল সেন্টার","","১৬১২৩","কৃষকরা কৃষি, মৎস্য ও প্রাণিসম্পদ বিষয়ে যে কোন সমস্যার তাৎক্ষণিক পরামর্শ পেতে কৃষি কল সেন্টারের অধীনে ১৬১২৩ হেল্পলাইন চালু করা হয়।  সরকারি ছুটির দিন ছাড়া প্রতিদিন সকাল ৭টা থেকে রাত ৯টার মধ্যে এই নম্বরে সেবা পাওয়া যাবে।"));
        movieList.add(new Movie("তথ্য সেবা", "", "৩৩৩", "৩৩৩ নম্বরে কল করে বাংলাদেশের যেকোনো প্রান্ত থেকে ৬৪ টি জেলায় অবস্থিত বিভিন্ন সরকারি কার্যালয়, তথ্য সেবা, সামাজিক সমস্যার প্রতিকার, সরকারি কর্মকর্তাদের তথ্য এবং জেলা ও পর্যটন সম্পর্কিত তথ্য পাওয়া যাবে। এছাড়া খাদ্যে ভেজাল, উঠপাদন, আমদানি, মজুত, বিপণন, ভোগ সংক্রান্ত যাবতীয় সমস্যার বিষয়ে এই হটলাইনে অভিযোগ জানানো যাবে।"));
        movieList.add(new Movie("কৃষি তথ্য", "", "৩৩৩১", "ধান, বীজ ও সারের তথ্যাদিসহ সকল কৃষি সংক্রান্ত তথ্য জানতে কল করুন ৩৩৩১ এ।"));
        movieList.add(new Movie("চাইল্ড হেল্প লাইন", "২৪ ঘণ্টা", "১০৯৮", "সুবিধাবঞ্চিত নির্যাতিত ও বিপদাপন্ন শিশুদের বিনামূল্যে ২৪ ঘণ্টা জরুরি সহায়তা সেবা দিতে ২০১১ সালে যাত্রা শুরু করে চাইল্ড হেল্পলাইন ১০৯৮।"));
        movieList.add(new Movie("বাংলাদেশ ব্যাংক","","১৬২৩৬","ব্যাংকিং সেবা পেতে হয়রানির শিকার হলে বা কোনো অভিযোগ থাকলে তা সরাসরি বাংলাদেশ ব্যাংকে জানানো যাবে ১৬২৬৩ নম্বরে।"));
        movieList.add(new Movie("ইউনিয়ন পরিষদ হেল্প লাইন","","১৬২৫৬","ইউনিয়ন পরিষদ পর্যায়ে যেকোনো ভাতা বা অনুদানসংক্রান্ত তথ্য ও পরামর্শ সেবা দিতে ২০১২ সালে যাত্রা শুরু করে ইউনিয়ন পরিষদ হেল্পলাইন ১৬২৫৬। যে কেউ দেশের যেকোনো প্রান্ত থেকে কল করে এই সেবা নিতে পারবে।"));



    }


}